/*
 * Carla ReWire Plugin
 * Copyright (C) 2014 Filipe Coelho <falktx@falktx.com>
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * For a full copy of the GNU General Public License see the doc/GPL.txt file.
 */

#include "CarlaPluginInternal.hpp"
#include "CarlaEngine.hpp"

#ifdef CARLA_OS_WIN64
# undef WANT_REWIRE
#endif

#ifdef WANT_REWIRE

#include "CarlaLibUtils.hpp"
#include "CarlaMathUtils.hpp"

// -----------------------------------------------------

CARLA_BACKEND_START_NAMESPACE

#if 0
}
#endif

// -----------------------------------------------------------------------
// ReWire assumes sizeof(long) == 4

typedef int32_t rlong;
typedef uint32_t rulong;

static_assert(sizeof(rlong) == 4, "Incorrect rlong size");
static_assert(sizeof(rulong) == 4, "Incorrect rulong size");

// rewire is not for linux, so for easy testing+development, we can skip this
#ifndef CARLA_OS_LINUX
static_assert(sizeof(long) == 4, "Incorrect long size");
static_assert(sizeof(ulong) == 4, "Incorrect ulong size");
static_assert(sizeof(long) == sizeof(rlong), "long size mismatch");
static_assert(sizeof(ulong) == sizeof(rulong), "ulon size mismatch");
#endif

struct RwOpenInfo {
    rulong size1; // 16
    rulong size2; // 12
    rlong sampleRate;
    rlong bufferSize;
};

struct RwDevInfo {
    rulong size; // 8288
    char name[32];
    rlong channelCount; // max limited to 255
    char channelNames[256][32];
    rulong defaultChannels[8];
    rulong stereoPairs[4];
    rulong eventBufferSize;
    rlong version;
};

struct RwAudioInfo {
    rulong size; // 12
    rlong sampleRate;
    rlong bufferSize;
};

struct RwBusInfo {
    rulong size; // 40
    rulong channel;
    char name[32];
};

struct RwEventInfo {
    rulong size; // 132 FIXME?
    rulong bus[32];
};

struct RwEvent { // 24
    ushort type;
    uchar d1, d2;
    rulong s1, s2, s3, s4, s5;
};

struct RwEventBuffer {
    rulong size1; // 20
    rulong size2; // 24 (of RwEvent)
    rulong count;
    rulong maxCount;
#ifndef CARLA_OS_LINUX // pointers on 64bit linux are size 8, skip this
    RwEvent* buf;
#else
    rulong buf;
#endif
};

struct RwAudioInInfo {
    rulong size; // 1116
    RwEventBuffer evBuf;
    rulong channels[8];
#ifndef CARLA_OS_LINUX // pointers on 64bit linux are size 8, skip this
    float* audioBuf[256];
#else
    rulong audioBuf[256];
#endif
    rlong tickStart;
    rulong frames;
    rulong playMode;
    rulong tempo; // bpm
    rulong signNumerator;
    rulong signDenominator;
    rlong loopStartPos;
    rlong loopEndPos;
    rulong loopOn;
};

struct RwAudioOutInfo {
    rulong size; // 56
    RwEventBuffer evBuf;
    rulong channels[8];
};

static_assert(sizeof(RwOpenInfo) == 16, "Incorrect ReWire struct size");
static_assert(sizeof(RwDevInfo) == 8288, "Incorrect ReWire struct size");
static_assert(sizeof(RwAudioInfo) == 12, "Incorrect ReWire struct size");
static_assert(sizeof(RwBusInfo) == 40, "Incorrect ReWire struct size");
static_assert(sizeof(RwEventInfo) == 132, "Incorrect ReWire struct size");
static_assert(sizeof(RwEvent) == 24, "Incorrect ReWire struct size");
static_assert(sizeof(RwEventBuffer) == 20, "Incorrect ReWire struct size");
static_assert(sizeof(RwAudioInInfo) == 1116, "Incorrect ReWire struct size");
static_assert(sizeof(RwAudioOutInfo) == 56, "Incorrect ReWire struct size");

// -----------------------------------------------------------------------

typedef void (*Fn_RWDEFCloseDevice)();
typedef void (*Fn_RWDEFDriveAudio)(RwAudioInInfo* in, RwAudioOutInfo* out);
typedef void (*Fn_RWDEFGetDeviceInfo)(RwDevInfo* info);
